In [62]:
import numpy as np
import pandas as pd
import math

In [63]:
df = pd.read_csv('handcomputationdata.csv')

In [64]:
df

   Gender  Carownership TravelCost IncomeLevel Transportationmode
0    Male             0      Cheap         Low                Bus
1    Male             1      Cheap      Medium                Bus
2  Female             0      Cheap         Low                Bus
3    Male             1      Cheap      Medium                Bus
4  Female             1      Cheap      Medium              Train
5  Female             1  Expensive        High                Car
6    Male             2  Expensive      Medium                Car
7  Female             2  Expensive        High                Car
8    Male             0   Standard      Medium              Train
9  Female             1   Standard      Medium              Train

In [65]:
df.columns = df.columns.str.lower()

In [66]:
df.describe()

       carownership
count     10.000000
mean       0.900000
std        0.737865
min        0.000000
25%        0.250000
50%        1.000000
75%        1.000000
max        2.000000

In [67]:
df_row = df.shape[0]
df_row

10

## Main Function

In [68]:
def cost_function_1(dataframe):
    df = dataframe
    listreturn = []
    #print(df.head())
    count_row = df.shape[0]
    
    for i in range((df['transportationmode'].nunique())):
        globals()['cat_{}_freq'.format(i)] = df['transportationmode'].value_counts()[i]
   
    cat_0_proportion = round(cat_0_freq/count_row,3)
    
    overall_entropy = round(- cat_0_proportion * math.log(cat_0_proportion,2) ,3)
    
    overall_gini_index = round( 1 - ((cat_0_proportion)**2) ,3)
    
    overall_cls_err = round(1 - (cat_0_proportion) ,3)
    
    listreturn.append(overall_entropy)
    listreturn.append(overall_gini_index)
    listreturn.append(overall_cls_err)
    return listreturn

In [69]:
def cost_function_2(dataframe):
    df = dataframe
    listreturn = []
    #print(df.head())
    count_row = df.shape[0]
    
    for i in range((df['transportationmode'].nunique())):
        globals()['cat_{}_freq'.format(i)] = df['transportationmode'].value_counts()[i]
   
    cat_0_proportion = round(cat_0_freq/count_row,3)
    cat_1_proportion = round(cat_1_freq/count_row, 3)
    
    overall_entropy = round(- cat_0_proportion * math.log(cat_0_proportion,2) 
                            - cat_1_proportion * math.log(cat_1_proportion,2),
                            3)
    
    overall_gini_index = round( 1 - ((cat_0_proportion)**2 
                                     + (cat_1_proportion)**2)
                               ,3)
    
    overall_cls_err = round(1 - max(cat_0_proportion, cat_1_proportion)
                            ,3)
    
    listreturn.append(overall_entropy)
    listreturn.append(overall_gini_index)
    listreturn.append(overall_cls_err)
    return listreturn

In [70]:
def cost_function_3(dataframe):
    df = dataframe
    listreturn = []
    #print(df.head())
    count_row = df.shape[0]
    
    for i in range((df['transportationmode'].nunique())):
        globals()['cat_{}_freq'.format(i)] = df['transportationmode'].value_counts()[i]
   
    cat_0_proportion = round(cat_0_freq/count_row,3)
    cat_1_proportion = round(cat_1_freq/count_row, 3)
    cat_2_proportion = round(cat_2_freq/count_row, 3)
    overall_entropy = round(- cat_0_proportion * math.log(cat_0_proportion,2) 
                            - cat_1_proportion * math.log(cat_1_proportion,2) 
                            - cat_2_proportion * math.log(cat_2_proportion,2)
                            ,3)
    overall_gini_index = round( 1 - ((cat_0_proportion)**2 
                                     + (cat_1_proportion)**2 
                                     + (cat_2_proportion)**2)
                               ,3)
    overall_cls_err = round(1 - 
                            max(cat_0_proportion, cat_1_proportion, cat_2_proportion)
                            ,3)
    
    listreturn.append(overall_entropy)
    listreturn.append(overall_gini_index)
    listreturn.append(overall_cls_err)
    return listreturn

In [71]:
df_values = cost_function_3(df)
df_values

[1.571, 0.66, 0.6]

## Subset of df - Gender Female

In [72]:
df_female = df[df['gender'] == 'Female']

In [73]:
df_female

   gender  carownership travelcost incomelevel transportationmode
2  Female             0      Cheap         Low                Bus
4  Female             1      Cheap      Medium              Train
5  Female             1  Expensive        High                Car
7  Female             2  Expensive        High                Car
9  Female             1   Standard      Medium              Train

In [74]:
df_female_row = df_female.shape[0]

In [75]:
female_values = cost_function_3(df_female)
female_values

[1.522, 0.64, 0.6]

## Subset of df - Gender Male

In [76]:
df_male = df[df['gender'] == 'Male']

In [77]:
df_male

  gender  carownership travelcost incomelevel transportationmode
0   Male             0      Cheap         Low                Bus
1   Male             1      Cheap      Medium                Bus
3   Male             1      Cheap      Medium                Bus
6   Male             2  Expensive      Medium                Car
8   Male             0   Standard      Medium              Train

In [78]:
df_male_row = df_male.shape[0]

In [79]:
male_values = cost_function_3(df_male)
male_values

[1.371, 0.56, 0.4]

## Gain of Gender based on

In [82]:
gender_entropy = round(df_values[0] 
                       - (( (df_female_row/df_row) * female_values[0]) 
                          + ((df_male_row/df_row) * male_values[0]))
                       ,3)
gender_entropy

0.125

In [60]:
female_values[1]

0.64

## Subset of df - Car Ownership 0

In [37]:
df_carownership_0 = df[df['carownership'] == 0]

In [38]:
df_carownership_0

   gender  carownership travelcost incomelevel transportationmode
0    Male             0      Cheap         Low                Bus
2  Female             0      Cheap         Low                Bus
8    Male             0   Standard      Medium              Train

In [39]:
carownership_0_values = cost_function_2(df_carownership_0)
carownership_0_values

[0.918, 0.444, 0.333]

## Subset of df - Car Ownership 1

In [40]:
df_carownership_1 = df[df['carownership'] == 1]

In [41]:
df_carownership_1

   gender  carownership travelcost incomelevel transportationmode
1    Male             1      Cheap      Medium                Bus
3    Male             1      Cheap      Medium                Bus
4  Female             1      Cheap      Medium              Train
5  Female             1  Expensive        High                Car
9  Female             1   Standard      Medium              Train

In [42]:
carownership_1_values = cost_function_3(df_carownership_1)
carownership_1_values

[1.522, 0.64, 0.6]

## Subset of df - Car Ownership 2

In [43]:
df_carownership_2 = df[df['carownership'] == 2]

In [44]:
df_carownership_2

   gender  carownership travelcost incomelevel transportationmode
6    Male             2  Expensive      Medium                Car
7  Female             2  Expensive        High                Car

In [45]:
carownership_2 = cost_function_1(df_carownership_2)
carownership_2

[-0.0, 0.0, 0.0]